{
    "report_detail": {
        "clientid": "task",
        "scan_id": "task",
        "client_name": "CyberLab Inc",
        "client_email": "info@cyberlabs.tech",
        "client_industry": "Government",
        "client_web_ip": "https://site.com",
        "final_score": "750",
        "status": "Notable",
        "Low_vuln": "0",
        "Medium_vuln": "0",
        "High_vuln": "1",
        "Critical_vuln": "0",
        "Vulnerability": [
            {
                "alert": "The external WP-Cron seems to be enabled: https://site.com/wp-cron.php",
                "CVE": "NULL",
                "severity": "High",
                "uri": "https://site.com/wp-cron.php",
                "description": "The wp-cron.php file is responsible for scheduled events in a WordPress website. By default, when a request is made, WordPress will generate an additional request from it to the wp-cron.php file. By generating a large number of requests to the website, it is therefore possible to make the site perform a DoS attack on itself.",
                "solution": "Add the variable DISABLE_WP_CRON to true in the file wp-config.php and restrict access to the file wp-cron.php."
            }
        ]
    },
    "Threatened": [
        {
            "system_defense": "Xcigence has detected Your system is behind a WAF or some sort of security solution",
            "system_defense_description": "Your existing security control system is comparable to a firewall that protects web applications and APIs by filtering, monitoring and blocking malicious web traffic and application-layer attacks — such as DDoS, SQL injection, cookie manipulation, cross-site scripting (XSS) , cross-site forgery and file inclusion",
            "vulnerability_threat": [
                {
                    "threat": "wp_cron is Enable",
                    "threat_description": "The wp-cron.php file is responsible for scheduled events in a WordPress website. By default, when a request is made, WordPress will generate an additional request from it to the wp-cron.php file. By generating a large number of requests to the website, it is therefore possible to make the site perform a DoS attack on itself.",
                    "threat_attackcomplexity": "Low",
                    "threat_confidentialityimpact": "High",
                    "threat_geolocation": "RU"
                }
            ],
            "Malicious_IP_Address_threat": {
                "Malicious_IP_Address_threat": "Xcigence has determined that the mentioned IPs are malicious IPs for one of the following reasons:Anonymous proxy: An IP address that is shielded using a VPN or other anonymizer to hide the original IP address.Botnets: An IP address that is infected with malware or other malicious software and is being controlled by another entity to attack other systems.Denial-of-service: This is an IP address that has a known history of launching any type of denial-of-service or anomalous traffic attack. These attacks target a website with a swarm of fake users or traffic, shutting down service for legitimate users.Illegal websites: If a website is currently hosting material that is illegal, it will be marked as a malicious IP. This includes anything from intellectual property violations to criminally obscene or unlawful material.Infected sources: An IP address that is distributing malware, viruses, or other infectious code.Phishing proxy: An IP that is hosting a website with active phishing or other fraudulent activity.Scanners: An IP address that is involved in any sort of attempt to scan or probe other domains for vulnerabilities that they can exploit. ",
                "Malicious_IP_Address__solution": "Maybe the mentioned IP is not part of the infrastructure of your network and is only related to it, but it can have destructive effects on your network.You can follow our solutions:Install software that only allows user-friendly methods of destruction and not any other methods.Make use of software that keeps your personal information private at all times.Because malicious IP addresses are legitimate and not illegal, blocking them on a large scale is difficult. So, for the time being, transfer your information to another system and deactivate it.Notify the cloud provider about the malicious IP address. Make a complaint to the Intelligence provider, such as AlienVault OTX, if they do not respond. The information about the malicious IP address will be reported as a result, and they will defend a stream of IP addresses as a result.Use a firewall that can identify suspicious IPs and proactively block them.Keep your software updated.Set up a good IP blocklist.",
                "Malicious_IP_Address": [
                    "PhishStats [67.199.248.12]"
                ]
            },
            "subdomain_threat": {
                "subdomain_threat": "Xcigence has Checked the subdomain takeover attack and Subdomain Hijacking on the subdomains and fortunately the subdomains are not vulnerable to the takeover subdomain.",
                "subdomain_solution": "",
                "subdomains": [
                    "academy.site.com",
                    "autodiscover.site.com",
                    "backup.site.com",
                    "beta.site.com",
                    "blog.site.com",
                    "cc.site.com",
                    "chat.site.com",
                    "clearance.site.com",
                    "cloud.site.com",
                    "dns1.site.com",
                    "doc.site.com",
                    "domains.site.com",
                    "fs.site.com",
                    "home.site.com",
                    "homer.site.com",
                    "hr.site.com",
                    "iicp.site.com",
                    "intranet.site.com",
                    "link.site.com",
                    "lyncdiscover.site.com",
                    "mail.site.com",
                    "mx1.site.com",
                    "mx2.site.com",
                    "mx3.site.com",
                    "mysql.site.com",
                    "mysql2.site.com",
                    "ncair.site.com",
                    "site.com",
                    "ns.site.com",
                    "ns1.site.com",
                    "ns2.site.com",
                    "ondi.site.com",
                    "rmp.site.com",
                    "scholarship.site.com",
                    "search.site.com",
                    "sip.site.com",
                    "start.site.com",
                    "test.site.com",
                    "w.site.com",
                    "wap.site.com",
                    "wc.site.com",
                    "web.site.com",
                    "web0.site.com",
                    "web02.site.com",
                    "web03.site.com",
                    "web1.site.com",
                    "web2.site.com",
                    "web4.site.com",
                    "web5.site.com",
                    "webadmin.site.com",
                    "webcam.site.com",
                    "webct.site.com",
                    "webdb.site.com",
                    "webdisk.site.com",
                    "weblog.site.com",
                    "webmail2.site.com",
                    "webmaster.site.com",
                    "webmin.site.com",
                    "webstore.site.com",
                    "whm.site.com",
                    "wifi.site.com",
                    "wiki.site.com",
                    "win32.site.com",
                    "windows.site.com",
                    "wordpress.site.com",
                    "work.site.com",
                    "ws.site.com",
                    "wsus.site.com",
                    "ww.site.com",
                    "ww0.site.com",
                    "ww02.site.com",
                    "ww03.site.com",
                    "ww1.site.com",
                    "ww2.site.com",
                    "www-0.site.com",
                    "www-00.site.com",
                    "www-000.site.com",
                    "www-001.site.com",
                    "www-002.site.com",
                    "www-003.site.com",
                    "www-004.site.com",
                    "www-005.site.com",
                    "www-006.site.com",
                    "www-007.site.com",
                    "www-008.site.com",
                    "www-009.site.com",
                    "www-01.site.com",
                    "www-02.site.com",
                    "www-03.site.com",
                    "www-04.site.com",
                    "www-05.site.com",
                    "www-06.site.com",
                    "www-07.site.com",
                    "www-08.site.com",
                    "www-09.site.com",
                    "www-1.site.com",
                    "www-2.site.com",
                    "www-3.site.com",
                    "www-4.site.com",
                    "www-5.site.com",
                    "www-6.site.com",
                    "www-7.site.com",
                    "www-8.site.com",
                    "www-9.site.com",
                    "www-test.site.com",
                    "www.clearance.site.com",
                    "www.site.com",
                    "www0.site.com",
                    "www00.site.com",
                    "www000.site.com",
                    "www001.site.com",
                    "www002.site.com",
                    "www003.site.com",
                    "www004.site.com",
                    "www005.site.com",
                    "www006.site.com",
                    "www007.site.com",
                    "www008.site.com",
                    "www009.site.com",
                    "www01.site.com",
                    "www02.site.com",
                    "www03.site.com",
                    "www04.site.com",
                    "www05.site.com",
                    "www06.site.com",
                    "www07.site.com",
                    "www08.site.com",
                    "www09.site.com",
                    "www1.site.com",
                    "www2.site.com",
                    "www3.site.com",
                    "www4.site.com",
                    "www5.site.com",
                    "www6.site.com",
                    "www7.site.com",
                    "www8.site.com",
                    "www9.site.com",
                    "wwwm.site.com",
                    "wwww.site.com"
                ]
            },
            "SSL_Certificate_Expired": {
                "SSL_Certificate_Expired_threat": "Once an SSL certificate expires, other clients (users with browsers) cannot verify your website authenticity. In addition, it may not comply with the latest security standards, leading to vulnerability in encryption mechanisms down the line.The mentioned SSL certificates have expired and what threats will you face:Customers’ Trust and Revenue Are at Stake: SSL certificates are a cornerstone in building a trust-based relationship between your business and customers.Man-in-the-Middle (MITM) Attack: A man-in-the-middle attack is a type of cyberattack where the attacker secretly relays — and possibly alters — the correspondence between two parties who believe that they are directly communicating with each other.The POODLE Attack : POODLE attacks are actually a vulnerability of SSL version 3.0 protocol, defined as “Padding Oracle On Downgraded Legacy Encryption,” aka POODLE vulnerability. SSL 3.0 vulnerability stems from the way blocks of data are encrypted under a specific type of algorithm within the SSL protocol.The BEAST Attack : BEAST (Browser Exploit Against SSL/TLS)  attacks exploit a vulnerability in the Transport-Layer Security (TLS) 1.0 and older SSL protocols, using the cipher block chaining (CBC) mode of encryption. It allows attackers to capture and decrypt HTTPS client-server sessions and obtain authentication tokens.The CRIME Attack : CRIME (Compression Ratio Info-leak Made Easy) is a security vulnerability that allows an attacker to perform session hijacking on an authenticated web session. This is done by compression, which can leak the content of secret web cookies.",
                "SSL_Certificate_Expired_solution": "Purchase or generate a new SSL certificate to replace the existing one.",
                "SSL_Certificate_Expired": [
                    "beta.site.com",
                    "domains.site.com",
                    "102.129.36.63"
                ]
            },
            "Open_TCP_Port": [
                {
                    "Open_TCP_Port_threat": "FTP is known for being outdated and insecure. As such, attackers frequently exploit it through:Brute-forcing passwords. Anonymous authentication (it’s possible to log into the FTP port with “anonymous” as the username and password). Cross-site scripting. Directory traversal attacks.Careless management of an FTP server may provide an attacker with access to execute code or overwrite important files.By its very nature, FTP is susceptible to DoS and DDoS attacks. A Denial of Service attack is when an attacker tries to overwhelm a victim’s server by flooding it with requests. In a Distributed Denial of Service (DDoS) attack, the attacker uses an army of unwitting third party servers to all attack the victim at the same time. ",
                    "Open_TCP_Port_solution": "Disable FTP unless you need it. Some server setups have FTP enabled by default.Disable standard FTP, use FTPS or SFTP instead.Update your SSH software to use strong ciphers and the lastest version of TLS (no SSL).Disable anonymous FTP if possible.Isolate your FTP server, don’t store anything on that server that you do not intend to share.If you can, use firewall rules to limit access to trusted IP addresses or MAC addresses.Be careful with file permissions of shared files.If your customers upload data to your FTP Server, use extra validation when reading it. ",
                    "Open_TCP_Port": [
                        "102.129.36.63:21",
                        "154.113.7.30:21"
                    ]
                },
                {
                    "Open_TCP_Port_threat": "Port 22 is for Secure Shell (SSH). It’s a TCP port for ensuring secure access to servers. Hackers can exploit port 22 by using leaked SSH keys or brute-forcing credentials.",
                    "Open_TCP_Port_solution": "Disabling password-based authentication - choosing this configuration makes brute-force password attacks impossible.Disabling root account remote login - This prevents users from logging in as the root (super user) account.  If a user needs high level of privilege, there are things like sudo that will enable them to do this if their job requires this level of access.Allow or deny access based on user or IP address - this a Secure Shell server that supports a particular business unit or app team, only allow that app team to access the system.Port forwarding – (aka SSH Tunneling) is another useful capability for forwarding or tunneling application ports from client to server, or vice versa.  Imagine a Linux box being able to listen for incoming / public requests and based on the type of request (file server, printer, email, et.) it knows where to send (tunnel) the traffic to another internal server.  Very useful.  But port forwarding requires careful configuration and hardening to make sure bad stuff from the internet is not forwarded into the private network.",
                    "Open_TCP_Port": [
                        "102.129.36.63:22"
                    ]
                },
                {
                    "Open_TCP_Port_threat": "Port 25 is a Simple Mail Transfer Protocol (SMTP) port for receiving and sending emails. Without proper configuration and protection, this TCP port is vulnerable to spoofing and spamming",
                    "Open_TCP_Port_solution": "1. Configure mail relay options carefully to avoid being an Open Relay2. Set up SMTP authentication to control user access3. Limit connections to protect your server against DoS attacks4. Activate Reverse DNS to block bogus senders5. Use DNSBL servers to fight incoming email abuse6. Activate SPF to prevent spoofed sources7. Enable SURBL to verify message content8. Maintain local IP blacklists to block spammers9. Encrypt POP3 and IMAP authentication for privacy concerns10. Have at least 2 MX records for failover",
                    "Open_TCP_Port": [
                        "102.129.36.63:25",
                        "154.113.7.30:25",
                        "41.78.83.236:25",
                        "41.78.83.238:25"
                    ]
                },
                {
                    "Open_TCP_Port_threat": "These are the default ports for SQL Server and MySQL. They are used to distribute malware or are directly attacked in DDoS scenarios. Quite often, attackers probe these ports to find unprotected database with exploitable default configurations.",
                    "Open_TCP_Port_solution": "Change remote connection to local connection.Isolate the Database Server.Tailor the DB Installation.Keep it Updated.Restrict the DB Processes.Restrict SQL Traffic.Use Least Privilege When Assigning Permissions.Set a Strong Admin Password.Audit DB Logins.Secure Your Backups.Protect Against SQL Injection.Continuous Visibility.",
                    "Open_TCP_Port": [
                        "102.129.36.63:3306"
                    ]
                }
            ],
            "co_shared_hosts": {
                "Co_Hosted_Site_threat": "If another website on your shared server is hacked, it could also spell trouble for your website’s performance. When a website is compromised, hackers can use it to execute malicious activities like storing illegal files and folders like wp-feed.php file, sending spam emails, launching attacks on another website.Every site owner should have backups stored off the server, but small site owners might use a backup system where they are stored on the local server. If the server suffers from a compromise or crashes, all sites hosted on the server could lose data. Backups stored on the server would also be lost, so it’s important for site owners to keep at least one backup copy offsite.Allowing anyone to upload and execute scripts could compromise the site and allow an attacker to elevate privileges. Scripts (e.g., Perl, shell scripts, PHP, etc.) should also be limited permissions set, and any custom user scripts should be heavily monitored and seldom given permissions to execute. It’s unlikely that uploaded content should ever be executable such as PHP, so features that allow users to upload files should have filters blocking known malicious scripts.if one website on the server is hacked, hackers can leverage their access to attack other sites residing on the same shared server.When a hacker wants to bring a website down they program thousands of malicious bots and devices to send a flood of traffic to a website.If a neighboring website conducts illegal activity or spams its customers, the IP address is blacklisted and marked as malicious.",
                "Co_Hosted_Site_solution": "Block PHP Execution in Unknown Folders.Set File Permissions.Install and Configure a Web Application Firewall.Distributed Denial-of-Service Attack Protection.Use SFTP Instead of FTP.Back-Up Data on Servers.Use Whitelisting for Maintenance IPs.Configure the Host’s HTTP Strict Transport Security (HSTS) Header.Force Password Changes.Configure Directory Permissions Properly.",
                "Co_Hosted_Site_source": [
                    "mail.site.com"
                ],
                "Co_Hosted_Site_List": [
                    "exchange.gbb.com.ng",
                    "mail.site1.com",
                    "mail.site2.com",
                    "mail.site3.com",
                    "mail.site4.com",
                    "mail.site5.com"
                ]
            },
            "human_name": {
                "human_name_threat": "Hackers can create email accounts in your name and use that account for phishing attacks against your colleagues or family.Phishing attacks are one of the most prominent widespread types of cyberattacks. It is a type of social engineering attack wherein an attacker impersonates to be a trusted contact and sends the victim fake mails.Unaware of this, the victim opens the mail and clicks on the malicious link or opens the mail's attachment. By doing so, attackers gain access to confidential information and account credentials. They can also install malware through a phishing attack. The attacker uses the password cracking technique and can easily crack your password by using the names in the password list.There are different types of password attacks like brute force attacks, dictionary attacks, and keylogger attacks.",
                "human_name_solution": "Scrutinize the emails you receive. Most phishing emails have significant errors like spelling mistakes and format changes from that of legitimate sources.Make use of an anti-phishing toolbar.Use strong alphanumeric passwords with special characters.Abstain from using the same password for multiple websites or accounts.Update your passwords; this will limit your exposure to a password attack.Do not have any password hints in the open.",
                "human_name_list": [
                    "Abdullahi Gambo",
                    "Abdullahi Usman",
                    "Abubakar Dahiru",
                    "Abubakar Tafawa",
                    "Abuja Enterprice",
                    "Adamawa Adamawa",
                    "Agu Collins",
                    "Akwa Ibom",
                    "Alhaji Aminu",
                    "Ali Ibrahim",
                    "Amin Haruna",
                    "Amina Sambo-Magaji",
                    "Aristotle Onumo",
                    "Babagana Monguno",
                    "Babajide Ayodimeji",
                    "Babangida Gilo",
                    "Bauchi Bauchi",
                    "Bauchi TBU",
                    "Bayelsa Bayelsa",
                    "Calistus Igwilo",
                    "Chuks Ekweme",
                    "Council EBEC",
                    "Dimie Shively",
                    "Domineum Blockchain",
                    "Emmanuel Edet",
                    "Faruk Mustapha",
                    "Fati Zanna",
                    "Governor Ogun",
                    "Helvetica Neue",
                    "Ibrahim Pantami",
                    "Jayeola Okuazun",
                    "Juliet Amamah",
                    "Kashifu Inuwa",
                    "Kemisola Bolarinwa",
                    "Kofo Abayomi",
                    "Lawan Mohammed",
                    "Limu Kenya",
                    "Lukman Lamid",
                    "Magnific Popup",
                    "Maimuna Jafaru",
                    "Mohammed Jega",
                    "Muhammed Saidu",
                    "Oladejo Olawumi",
                    "Olatunji Olalekan",
                    "Oye Ekiti",
                    "Press Ctrl-",
                    "Salisu Kaka",
                    "Samad Akesode",
                    "Segoe Emoji",
                    "Symfony VarDumper",
                    "Umar Ibrahim",
                    "Yemi Osinbajo",
                    "Yewande Foluke"
                ]
            },
            "Phone_number": {
                "phone_number_threat": "Hackers use different technologies and techniques by war dialing to automatically call multiple phone numbers to find weak points in an IT security infrastructure. This security infringement helps hackers to search for vulnerable modems using war dialing tools.TDoS attacks (Telephony Denial of Service) are a form of Denial of Service (DoS) attack that affects enterprise, government, emergency 911, financial call centers and other business voice systems. It is a significant threat to voice systems and public safety.A TDoS attack is an attempt to make a telephone system unavailable to the intended user(s) by preventing incoming and / or outgoing calls. The objective is to keep the distraction calls active for as long as possible to overwhelm the victim’s telephone system, which may delay or block legitimate calls for service.",
                "phone_number_solution": "The blocking of known malicious caller IDs.Enabling algorithms on SIP trunks that can recognize TDoS events and dynamically block calls, while temporarily increasing the number of available voice paths, ensuring at least partial service for legitimate users during an attack.Install and Config a Session Border Controller (SBC) : If the percentage of connection requests or calls exceeds a limit, the SBC can block new incoming calls.  During the attack:Limit the number of telephones that the attacked number rings on. When doing so, take into account busy and no answer roll-over functionality. If possible, limit the calls to one telephone and dedicate only one employee to answering that line. If it is a crucial line, use social media and other channels to advertise another line as being in service for that day.If crucial telephone numbers use the same telephone branch exchange (PBX), consider moving the crucial lines to a different, temporary PBX in case the PBX itself is targeted or overwhelmed.In some cases the calls may use an automated message. If that occurs and the message appears to be from a legitimate third party, contact the National Communication Center (NCC) as it may be possible the other party is also a victim and would be willing to disable the auto call functionality.Attempt to determine if the attack is meant as a distraction from another event, such as an unauthorized wire transfer.",
                "phone_number_list": [
                    "+11111111111",
                    "+12222222222",
                    "+13333333333"
                ]
            }
        }
    ],
    "Digital_User_Risk": [
        {
            "mailservice": "site.com.\n",
            "mailservice_description": "You are Using 'site.com.\n'.Your Email Service is Vulnerable against Phishing , Bruteforce Attack and Malicious emails ",
            "email_at_risk_low": [
                "academy@site.com",
                "cangaye@site.com",
                "cizi@site.com",
                "contact@site.com",
                "dg@site.com",
                "domains@site.com",
                "eezekwesili@site.com",
                "gajayi@site.com",
                "gitexinfo@site.com",
                "humar@site.com",
                "ictyes@site.com",
                "iicp@site.com",
                "info@site.com",
                "iyelwa@site.com",
                "llamid@site.com",
                "mbulama@site.com",
                "mubaru@site.com",
                "ncair@site.com",
                "nezo@site.com",
                "nwzo@site.com",
                "oadeluyi@site.com",
                "oiie@site.com",
                "olitan@site.com",
                "ondi@site.com",
                "pitonyo@site.com",
                "scholarship@site.com",
                "servicom@site.com",
                "slawal@site.com",
                "sszo@site.com",
                "standards@site.com",
                "swzo@site.com",
                "ubadamasi@site.com",
                "volatunji@site.com"
            ],
            "email_at_risk_medium": [
                "academy@site.com",
                "ncair@site.com",
                "nezo@site.com",
                "nwzo@site.com",
                "sszo@site.com",
                "swzo@site.com"
            ],
            "email_at_risk_high": [
                "domains@site.com",
                "iicp@site.com",
                "info@site.com",
                "ondi@site.com"
            ],
            "email_risks": "Phishing.Malware.Spam.Data Loss.Authentication Attacks on Email Servers.Botnets and DDoS.Man-in-the-middle (MitM) attack.Brute force attack.",
            "email_risks_solution": "Implement Multi-Factor Authentication.Enable a Spam Filter.Config Sender Policy Framework (SPF).Config Domain Keys Identified Mail (DKIM).Config Domain-based Message Authentication, Reporting & Conformance (DMARC).Configure Attachment Sandboxing.",
            "hacked_email_address": {
                "hacked_email_address_solution": "Change Email Name.Use strong password.Implement Multi-Factor Authentication.",
                "hacked_email_address": [
                    "eezekwesili@site.com [netlog.com]",
                    "info@site.com [crunchbase.com]",
                    "oadeluyi@site.com [adobe.com]"
                ]
            }
        }
    ]
}